/datum/socialrole/shop/bacotell
	uniforms = list(/obj/item/clothing/under/vampire/bacotell)
	hats = list(/obj/item/clothing/head/vampire/baseballcap)
	random_phrases = list(
		"Добро пожаловать в Baco Tell.",
		"Мы не несём юридической ответственности за то, что вы делаете с нашей едой. Особенно если вы её едите.",
		"Говядина с приправами. С какими? А мне откуда знать?",
		"Да, оно так и должно выглядеть.",
		"Я ем тут каждый день уже два года. Мой врач в недоумении.",
		"В неотложку? Только не опять...",
		"Наш сырный соус для начос недавно одобрили в FDA!",
		"Я, между прочим, в колледже учился.",
		"Вы из санинспекции? Нет? Фух...",
		"Нет, в туалет нельзя, он только для персонала.",
		"За что заплатили, то и получили.",
	)
