/datum/socialrole/shop/bubway
	uniforms = list(/obj/item/clothing/under/vampire/bubway)
	random_phrases = list(
		"Добро пожаловать в Bubway. Проходите дальше вдоль стойки.",
		"Да, это у нас есть. Нет, двойную порцию нельзя.",
		"Пятнадцать сантиметров или тридцать?",
		"Я собрал десять тысяч сэндвичей. Я больше ничего не чувствую.",
		"Хлеб свежий. Ну, был свежим...",
		"Эх... Вам ещё и подогреть?",
		"Сэр, это Bubway.",
		"Овощная котлета формально считается едой.",
		"Пожалуйста, не читайте отзывы...",
		"Всё свежее. Мясо... ну, с прошлого раза.",
		"Я, знаете ли, и сам в некотором роде художник! Художник по сэндвичам.",
		"Вы из санинспекции? Нет? Фух...",
		"Я шесть раз становился работником месяца. Нас тут всего двое.",
	)
