/datum/socialrole/shop/garden //community garden
	neutral_phrases = list(
		"Хотите что-нибудь купить?",
		"Никаких инвазивных видов, всё подобрано под местный климат!",
		"Простите, пакеты закончились."
	)
	random_phrases = list(
		"Скажите, как будете готовы.",
		"Следующий, сюда, пожалуйста!",
		"Помидоры в этом году поспели раньше срока, представляете?",
		"Мы компостируем всё. Вообще всё.",
		"У меня руки уже десять лет как не отмываются.",
		"Пчёлы в последнее время очень сговорчивые.",
		"Я каждому растению дал имя...",
		"Пестицидами мы не пользуемся. Жучки - тоже часть нашей общины.",
		"А вот этот вырос немного странным...",
		"Я тут с шести утра.",
		"Мой психотерапевт говорит, что я провожу тут слишком много времени...",
	)
	help_phrases = list(
		"Зачем вы так?!",
		"Берите что хотите, только отпустите!",
		"Кто-нибудь, позовите врача!"
	)
