/datum/socialrole/shop/gummaguts
	uniforms = list(/obj/item/clothing/under/vampire/gummaguts)
	hats = list(/obj/item/clothing/head/vampire/baseballcap)

	random_phrases = list(
		"Добро пожаловать в Gummaguts.",
		"Картошку фри будете?",
		"Наша говядина на все сто процентов близка к говядине.",
		"Только что из микроволновки, специально для вас.",
		"Эту табличку нас заставили повесить в FDA.",
		"Нет, этот запах - норма.",
		"По закону мы обязаны предупредить: здесь есть аллергены. Все, какие бывают.",
		"Сэр, это Gummaguts.",
		"Санинспектор назвал это \"агрессивно съедобным\".",
		"Номер один в городе по версии горожан! ...В категории \"дёшево\".",
		"Всё свежеприготовленное. \"Свежее\" - понятие юридически растяжимое.",
		"Вы из санинспекции? Нет? Фух...",
		"Аппарат для коктейлей сломан.",
		"Комбо возьмёте?",
		"Нет, салатов у нас не бывает.",
		"Некоторые едят тут каждый день.",
		"Gummaguts - потому что готовят только те, у кого есть время!",
	)
