/datum/socialrole/shop/hardwarestore
	uniforms = list(/obj/item/clothing/under/vampire/mechanic)
	shoes = list(/obj/item/clothing/shoes/vampire/jackboots)
	hats = list(/obj/item/clothing/head/vampire/baseballcap)
	gloves = list(/obj/item/clothing/gloves/vampire/work)
	suits = list(/obj/item/clothing/suit/hazardvest)
	random_phrases = list(
		"Вам помочь или вы просто смотрите?",
		"Вы же семь раз отмерили, да?",
		"Есть и метрические, и дюймовые. Выбирайте сторону.",
		"Это должно помочь... наверное...",
		"Изолента? Кончилась.",
		"Вы что-то строите или делаете вид, что строите?",
		"Вы подрядчик? Ну конечно нет...",
		"Сойдёт и то, что подешевле... надеюсь.",
		"Что, насмотрелись уроков в интернете?",
		"Не знаю, что вы там строите, и решил не спрашивать.",
// CRIMSON GRID ADD START - Shop TLC
		"Вы только гляньте, сколько тут всего...",
		"У нас есть шестигранники, кормушки для песчанок, сиденья для унитаза, обогреватели...",
		"Парных солонок с перечницами сейчас нет в наличии.",
		"Не желаете ли пестициды для окуривания... или высокоэффективную смазку?",
		"Каждому двадцать седьмому покупателю - слесарный молоток в подарок!",
		"У нас найдутся особые плоскогубцы для КАЖДОЙ комнаты вашего дома!",
		"Автоматические аппараты для обрезания возврату НЕ подлежат. Совсем.",
		"Что, совсем невтерпёж?",
		"Дверь откроется тогда, когда мы скажем. Хватит спрашивать.",
// CRIMSON GRID ADD END - Shop TLC
	)
