/datum/socialrole/shop/pharmacystore
	uniforms = list(/obj/item/clothing/under/vampire/nurse)
	shoes = list(/obj/item/clothing/shoes/vampire/white)
	glasses = list(/obj/item/clothing/glasses/vampire/perception)
	suits =  list(/obj/item/clothing/suit/vampire/labcoat)
	random_phrases = list(
		"А рецепт у вас на это есть?",
		"Я, кстати, не врач.",
		"Вот это плохо сочетается с алкоголем. Проверено на собственном горьком опыте...",
		"Среди побочных эффектов возможна внезапная смерть.",
		"Похоже, вы занимаетесь самолечением...",
		"Провизор в подсобке. К нему сейчас нельзя.",
		"Страховка? Э-э...",
		"Все лицензии у нас в порядке. Надеюсь...",
		"Срок годности - это скорее рекомендация.",
		"Вам что-нибудь посильнее или то, от чего просто становится всё равно?",
		"В прошлом месяце у нас была санитарная проверка. Некоторые товары... обсуждались.",
		"У нас тут аптека, приятель, а не то, что ты подумал!",
		"У вас, похоже, стресс. От этого у нас кое-что есть. И от этого тоже. И от того, что начнётся после этого.",
		"Если не помогает - удвойте дозу.",
		"Рано или поздно каждый в этом городе оказывается у этого прилавка...",
	)
