import { createDropdownInput, type Feature } from '../base';

export const pixel_size: Feature<number> = {
  name: 'Масштабирование пикселей',
  category: 'Интерфейс',
  component: createDropdownInput({
    0: 'Растянуть по окну',
    1: 'Точно по пикселям 1x',
    1.5: 'Точно по пикселям 1.5x',
    2: 'Точно по пикселям 2x',
    3: 'Точно по пикселям 3x',
    4: 'Точно по пикселям 4x',
    4.5: 'Точно по пикселям 4.5x',
    5: 'Точно по пикселям 5x',
    6: 'Точно по пикселям 6x',
    7: 'Точно по пикселям 7x',
    8: 'Точно по пикселям 8x',
    9: 'Точно по пикселям 9x',
  }),
};
