GLOBAL_LIST_INIT(morality_paths, init_morality_paths())

/proc/init_morality_paths()
	var/list/paths = list()
	for(var/morality_type in subtypesof(/datum/morality))
		var/datum/morality/M = new morality_type()
		paths[initial(M.name)] = M
	return paths

/datum/morality
	var/name = ""
	var/desc = ""
	/// Humanity or Enlightenment
	var/alignment
	/// The bearing of the path's ethos
	var/bearing

/datum/morality/proc/show_lore(mob/user)
	to_chat(user, span_notice("[uppertext(get_display_name())]<br><br>[alignment == MORALITY_HUMANITY ? "Опирается на Самоконтроль и Совесть" : "Опирается на Инстинкты и Решимость"] <br> <br>Каждый вампир следует Пути - учению, которое помогает примирить Зверя, жаждущего лишь бойни и крови, с сознанием, уцелевшим со смертных дней. Большинство вампиров вне Шабаша держится Пути Человечности. Тот, кто сходит со своего Пути, рискует одичать: окончательно уступить Зверю и превратиться в безмозглую бродячую тварь. <br> <br>[desc]<br>"))

/datum/morality/humanity
	name = "Path of Humanity"
	ru_name = "Путь Человечности"
	desc = "Путь Человечности - самый распространённый среди Сородичей и единственный, который признаёт Камарилья. Его суть проста: противостоять Зверю можно, лишь храня верность ценностям и природе смертной жизни. Как Маскарад скрывает вампиров от мира смертных, так Человечность усмиряет Зверя, отрицая вампиризм и его самые тёмные порывы, поэтому Маскарад и Человечность идут рука об руку. В отличие от большинства Путей, Человечность даёт немало преимуществ, в том числе влияет на то, насколько вампир похож на человека в чужих глазах. Тот, кто принял Путь Просветления или далеко ушёл от Человечности, может вовсе не дышать и не моргать, по-звериному скалиться, смотреть запавшими глазами. Но не обманывайтесь: вампир на Пути Человечности - не святой. Вампиры - хищники по природе, и Путь этого не отменяет. Этим Путём идёт и большинство смертных, но, по иронии, вампир с очень высокой Человечностью может казаться человечнее многих живых. Сойти с этого Пути крайне опасно: для этого нужны очень низкая Человечность и наставник, а ваш персонаж навсегда отбросит всё, что когда-то делало его человеком: привычки, убеждения, облик и мораль."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_MUNDANE

/datum/morality/power
	name = "Path of Power and the Inner Voice"
	ru_name = "Путь Власти и Внутреннего Голоса"
	desc = "Путь Власти и Внутреннего Голоса - Путь Просветления, который подчиняет Зверя несгибаемой целеустремлённостью и накоплением мирской власти. Его последователей называют Объединителями."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_COMMAND

/datum/morality/heaven
	name = "Path of Heaven"
	ru_name = "Путь Небес"
	desc = "Последователи Via Caeli обуздывают Зверя религиозным служением. Их часто называют Верными."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_HOLINESS

/datum/morality/metamorphosis
	name = "Path of Metamorphosis"
	ru_name = "Путь Преображения"
	desc = "Путь Преображения - Путь Просветления, который подчиняет Зверя, исследуя его пределы и пределы вампиризма как такового. Он вырос из древней Дороги Метаморфоз, и следуют ему в основном Цимисхи."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_INHUMANITY

/datum/morality/assamite
	name = "Path of Blood"
	ru_name = "Путь Крови"
	desc = "Путь Крови - Путь Просветления, почти не встречающийся за пределами клана Бану Хаким. Его последователи сражаются со Зверем через беззаветную преданность делу своего основателя. Их называют дервишами."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_RESOLVE

/datum/morality/hive
	name = "Path of the Hive"
	ru_name = "Путь Улья"
	desc = "Via Hyron, чаще называемая Дорогой Улья или Путём Улья, - малая Дорога, которой следуют почти исключительно Баали. Её последователей называют абеленами."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_JUSTICE

/datum/morality/kings
	name = "Road of Kings"
	ru_name = "Дорога Королей"
	desc = "Via Regalis, или Дорога Королей. Её последователи укрощают Зверя, властвуя над другими. Смертные - низшие существа, данное слово нерушимо, а власть - это всё. Идущих Дорогой Королей называют Наследниками."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_COMMAND

/datum/morality/heart
	name = "Path of the Scorched Heart"
	ru_name = "Путь Выжженного Сердца"
	desc = "Путь Выжженного Сердца, изначально Путь Ратмоника, - древний Путь Просветления, зародившийся среди Истинных Бруха. Он основан на \"Книге Пустого Сердца\" Ратмоника и поначалу расходился среди немногих Сородичей в лоне католической церкви; позднее его тексты собрала воедино Истинная Чёрная Рука. Путь подчиняет Зверя, методично искореняя в сердце вампира всякое чувство. Особенно он близок Истинным Бруха, которые и без того скупы на эмоции. Его последователей называют Непрощающими."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_INTELLECT

/datum/morality/typhon
	name = "Path of Typhon"
	ru_name = "Путь Тифона"
	desc = "Путь Тифона - Путь Просветления, во многом выросший из учения сетитов и культа их Патриарха. Его последователей называют теофидианами и тифонистами, а чужаки зовут их Растлителями."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_DEVOTION

/datum/morality/typhon/ecstasy
	name = "Path of Ecstasy"
	ru_name = "Путь Экстаза"
	desc = "Путь Экстаза тесно связан с одной из ветвей сетитского учения: само упоение эйфорией для него свято. Экстатики закармливают Зверя наслаждениями, пока тот не разжиреет и не обленится, и отличаются от тифонистов тем, что их занимают сами удовольствия, а не растление."
	bearing = BEARING_RAPTURE

/datum/morality/typhon/warrior
	name = "Path of the Warrior"
	ru_name = "Путь Воина"
	desc = "Сетиты этого Пути не растлевают из тени, а воплощают Сета-воителя. Собственный фанатизм и мазохизм для них и есть священнодействие: они ведут войну, в которой их доблесть должна устрашить самого Зверя."
	bearing = BEARING_FURY

/datum/morality/bones
	name = "Path of the Bones"
	ru_name = "Путь Костей"
	desc = "Путь Костей, чьих последователей прозвали Могильщиками, - Путь Просветления, который усмиряет Зверя, постигая истинную природу смерти и её связь с иными состояниями бытия. Исследователи смерти и перехода в неё, они ценны для Некромантии и танатологии не политической или практической пользой от общения с мёртвыми, а самим знанием. Этот Путь порой упрекают в том, что он воспевает бессмысленные убийства, но у Могильщика любопытство попросту сильнее заботы о чужой жизни, и всякая смерть, с которой он сталкивается, может стать предметом его мрачного интереса. Поэтому Могильщики редко имеют дело со смертными и обычно замкнуты и молчаливы."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_SILENCE

/datum/morality/bones/death
	name = "Path of Death and the Soul"
	ru_name = "Путь Смерти и Души"
	desc = "Этот Путь называют \"вдохновлённым\" Путём Костей, когда хотят быть великодушными, и \"украденным\" у него, когда не хотят. Догматы у них во многом общие, но встречается он чаще в Шабаше. Его последователи настаивают на своей самобытности, однако посторонним пока не удалось разглядеть, в чём она состоит."

/datum/morality/night
	name = "Path of Night"
	ru_name = "Путь Ночи"
	desc = "Идущие этим Путём принимают, что Становление обрекло их на проклятие, и не намерены быть проклятыми в одиночку. Путь распространён главным образом среди молодых Ласомбра, и суть его проста: быть орудием зла и исполнять свою греховную природу."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_DARKNESS

/datum/morality/night/road
	name = "Road of Night"
	ru_name = "Дорога Ночи"
	desc = "Via Noctis, или Дорога Ночи. Искупители ощущают тяжесть проклятия Каина и собственной обречённости даже острее, чем последователи Via Caeli. Как и Верные, они ищут искупления и прощения, а заслужить их можно лишь страданием и очищением. Но если Верные идут к этому довольно безобидными способами, то Искупители выходят в мир людей, чтобы карать и убивать смертных грешников. Одни назначают епитимью за малые проступки, другие даруют Становление неисправимым смертным, чтобы те помогали им вершить кару. Охотятся они и на каинитов, которые совращают смертных, в первую очередь на Последователей Сета и Баали."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_GUILT

/datum/morality/honor
	name = "Path of Honorable Accord"
	ru_name = "Путь Чести"
	desc = "Путь Чести - Путь Просветления, который обуздывает Зверя строгим следованием законам чести и рыцарства. Эти вампиры известны верностью своему кругу, его предводителям и союзникам, а данное слово для них нерушимо: долг превыше всего. Их называют Рыцарями, Патриотами или канониками. Но не обманывайтесь: в них нет ни сострадания, ни человечности. Люди для них по-прежнему скот и пища, и законы чести, которыми они связаны с другими вампирами, на смертных не распространяются."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_DEVOTION

/datum/morality/beast
	name = "Path of the Feral Heart"
	ru_name = "Путь Дикого Сердца"
	desc = "Путь Дикого Сердца (иногда его называют \"Путём Зверя\") - Путь Просветления, особенно распространённый среди Гангрелов. Он подчиняет Зверя, признавая его порывы естественными и принимая роль охотника среди охотников. Его последователей называют Дикими или Зверями."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_MENACE

/datum/morality/beast/harmony
	name = "Path of Harmony"
	ru_name = "Путь Гармонии"
	desc = "Близкий родич Пути Дикого Сердца, который нередко считают его более древней разновидностью. Гармонист так же видит себя хищником, но соотносит эту роль со своим местом в мире природы и, как правило, наделён более чуткой Совестью."

/datum/morality/samiel
	name = "Code of Samiel"
	ru_name = "Кодекс Самиэля"
	desc = "Кодекс Самиэля - учение, закрепившее догматы салюбри-воинов и Пути Воздаяния. Его составил сам Самиэль, величайший воин среди потомков Саулота. Его последователи клянутся воздавать по заслугам всякому злу, и прежде всего инферналистам, демонам и Последователям Сета. Главные их добродетели - отмщение, бдительность и праведность."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_JUSTICE //I have no idea what this actually does

/datum/morality/caine
	name = "Path of Caine"
	ru_name = "Путь Каина"
	desc = "Путь Каина, чьих последователей обычно называют ноддистами, избирают каиниты, посвятившие себя изучению вампирской природы, прежде всего через подражание Каину и учение Книги Нод. Они клянутся изучать, размышлять и докапываться до истинного смысла вампирского бытия, а ещё принять это состояние и достичь его высшей формы. Обычно это учёные или склонные к самосозерцанию вампиры, которых отличают дисциплина и строгость к себе. Ноддисты клянутся отринуть утраченную человечность, принять свою новую природу, во всём подражать Каину и через диаблери забирать витэ недостойных, чтобы приблизиться к Тёмному Отцу. Грехи: водить дружбу или уживаться со смертными, поддаться Безумию или Ротшреку, не совершить диаблери над \"человечным\" вампиром, пренебрегать изучением вампиризма, а также отрицать потребности вампира: не питаться или проявлять сострадание."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_FAITH

/datum/morality/cathari
	name = "Path of Cathari"
	ru_name = "Путь Катаров"
	desc = "Путь Катаров, чьих последователей обычно называют альбигойцами, вырос из катарской ереси, расколовшей католическую церковь в Тёмные века. Катары учили, что мир создан в равной мере добрым (\"светлым\") творцом, от которого исходят добродетель и дух, и злым (\"тёмным\"), которому принадлежат материальный мир и все его пороки. Вампиры этого Пути рассуждают так: раз бессмертие лишает проклятых вечного духовного покоя в посмертии, то сама их суть - служить \"тёмному\" творцу, искушая других всеми соблазнами материального мира. Иными словами, они ищут духовность в \"порочности\". Грехи: проявлять сдержанность, доверять, убивать, жертвовать собственным удовольствием ради чужого удобства, отказывать себе в излишествах, призывать к сдержанности других."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_SEDUCTION // add this

/datum/morality/lilith
	name = "Path of Lilith"
	ru_name = "Путь Лилит"
	desc = "Последователи Пути Лилит, которых часто называют Бахари или Лилин, постигают учение и уроки Лилит. Большинство каинитов Шабаша считает их еретиками. Бахари хранят древние обычаи, завещанные самой Лилит, и верят, что боль, испытания и страдание - единственные дороги к знанию и подлинному росту. Лишь страдая, лишь познав пределы творения и его ощущений, можно обрести понимание, и к тем, кому недостаёт прозорливости или воли ступить на эту дорогу, они не знают сострадания. Грехи: утолять голод сразу, как только он пришёл, гнаться за богатством или властью, не поправлять тех, кто искажает историю Каина и Лилит, жалеть страдающего, бояться смерти, убивать, не причинять боли и мучений, избегать боли."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_TRIBULATION // add this

/datum/morality/lilith/seed
	name = "Path of the Serpent's Seed"
	ru_name = "Путь Змеиного Семени"
	desc = "Разновидность веры Бахари, последователи которой предпочитают действовать куда мягче. Чтобы одолеть Каина, им не нужно разрушение: они охотнее подточат ноддистов изнутри и похоронят его наследие."

/datum/morality/lilith/midwives
	name = "Path of the Red Midwives"
	ru_name = "Путь Красных Повитух"
	desc = "Разновидность веры Бахари, для последователей которой рождение и творение - искусство. Нечеловеческие, чудовищные создания вокруг них и те, кто только что прошёл Становление, - зрелище, достойное восхищения, и подспорье в поисках силы в этом мире."

/datum/morality/lilith/thorn
	name = "Path of the Thorn Garden"
	ru_name = "Путь Тернового Сада"
	desc = "Разновидность веры Бахари, последователям которой присуще куда более острое чувство справедливости. Месть уступает место надзору за кодексом и законом, а нарушителей карают с лихвой."

/datum/morality/lilith/witches
	name = "Path of the Lilin Witches"
	ru_name = "Путь Ведьм Лилин"
	desc = "Разновидность веры Бахари. Ведьмы ищут запретные знания Тёмной Матери, защищают единоверцев и даже взращивают среди смертных культы Богини, чтобы те славили Её."

/datum/morality/redemption
	name = "Path of Redemption"
	ru_name = "Путь Искупления"
	desc = "У Бога тысячи имён: Иисус, Яхве, Аллах, Ахура-Мазда. Но одно несомненно: вампиры, бессмертные, проклятые Богом, видевшие Великий Потоп и жившие в Первом Городе, знают, что Бог есть. Поэтому последователи этого Пути истово преданы своей вере и её заповедям, а в Проклятии видят доказательство того, что в день суда милосердный творец даст им шанс на искупление. Да, вампиры изгнаны с Небес, но что если всё это испытание? Идущие Путём Искупления, которых обычно зовут \"мучениками\", стремятся искупить вину, жертвуя собой ради других: так они перебарывают себялюбивую, животную тягу Зверя и вновь становятся достойны прощения избранного Бога (или богов). Но Бог не ждёт совершенства. Последователи Пути принимают Божественный Прилив - естественный круговорот греха, прощения и перерождения. От них также ждут, что они будут исповедовать собратьев по Пути и исповедоваться сами. Эти вампиры не святые: грех для них - печальная и неизбежная часть Божественного Прилива, которую они надеются однажды преодолеть последним великим подвигом мученичества, искуплением. Грехи: отступать от заповедей своей религии, ставить телесное выше духовного, отказывать другим в возможности искупления, отказываться исповедовать или исповедоваться, оставить безнаказанным смертный грех (похоть, чревоугодие, гнев, гордыню), убивать невинных. Магию крови на этом Пути не одобряют."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_FAITH

/datum/morality/revelation
	name = "Path of Evil Revelations"
	ru_name = "Путь Откровений Зла"
	desc = "Демоны, падшие ангелы, были первыми детьми Бога: они появились раньше, чем человек был вылеплен из глины, и раньше, чем родился Каин. Первый Мятежник, владыка Люцифер, потребовал от Бога объяснений о Его запретных творениях во Тьме, Клипот, но Бог не только отказал ему, а навеки изгнал с Небес вместе с союзниками: ведь объясни Он Люциферу природу этих творений, открылось бы, что Бог глупец. Несправедливый отец-тиран, у которого среди детей есть любимчики. Эта великая несправедливость, скрытая от разумения смертных, будет исправлена, когда Люцифер завершит свой мятеж. Его воинство демонов превосходит числом ангелов, и когда самозванцы будут низвергнуты, Творение обретёт должный порядок. Вампиры Пути Откровений Зла, которых называют \"инферналистами\", повинуются демонам и считают себя их союзниками, причём союзниками естественными: и те, и другие изгнаны с Небес и стоят вне природного порядка, ведь вампиры охотятся на людей, детей Божьих. Последователи этого Пути не просто принимают зло в себе, такое предлагают многие Пути. Здесь требуется участвовать в битве, которая куда древнее человечества, вампиризма и самого творения, и служить непостижимому \"злу\". Грехи: подчиняться каким-либо законам, пренебрегать инферналистскими ритуалами, совершать бескорыстные поступки, упускать возможность захватить власть, действовать в собственных интересах, отказываться поддерживать инфернальные зверства, не служить своему демону-покровителю, а также позволить слугам Бога победить или перехитрить себя."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_CORRUPTION

/datum/morality/entelechy
	name = "Path of Entelechy"
	ru_name = "Путь Энтелехии"
	desc = "Этот интеллектуальный Путь создали европейские Бруха. Он утверждает, что Via Humanitas, которая лишь отвергает и подавляет Зверя, пассивна, и этого никогда не будет достаточно. Со Зверем нужно сражаться деятельно, строгой и дисциплинированной работой ума: когда-то эти качества были сутью клана Бруха, и последователи Пути надеются с их помощью вернуть клану законное место царей-воителей среди Сородичей. Три его столпа - Энкратейя (внутренняя сила), Рейе (отвага) и Софросюне (власть над собой). Этот требовательный и кропотливый Путь - вечная битва со Зверем там, где Человечность всего лишь отвергает его. Грехи: нечёткая или праздная мысль, поступки по первому побуждению, мелкие преступления вроде кражи, грабежа или вандализма, намеренный вред любому смертному, насильственное кормление на невинном, уступка Зверю, оставленное безнаказанным преступление, убийство невинных, помощь идущему иным Путём. Никогда не проявляйте трусости. Никогда не принимайте смертных как должное. Питайтесь лишь затем, чтобы жить, и не более. Посвятите себя упорной учёбе и размышлениям, и вы подчините Зверя. Путь этот чрезвычайно редок: подавляющее большинство его последователей - старейшины Бруха, которые вновь распространяют его в ответ на \"падение\" клана, пока Свободное государство анархов противостоит Мандаринату Нового Обета."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_RESOLVE

/datum/morality/ashirra
	name = "Sharia El-Sama"
	ru_name = "Шариа эль-Сама"
	desc = "В 623 году от Рождества Христова каинит по имени Сулейман ибн Абдулла прибыл в Медину, чтобы поохотиться на пророка Мухаммеда и испить его крови. Сулейман попросил о встрече с Пророком и, получив её, был потрясён: святость Божьего посланника сразила его, и он склонился перед ним. Сулейман ибн Абдулла стал первым из Аширра, Братства вампиров, поклявшихся блюсти священный закон Божий, данный через последнего и величайшего из Его пророков. Так можно заставить умолкнуть демона внутри, Зверя, и молитвой и непоколебимой верой искать у Бога прощения. Грехи: не соблюдать еженощно пять столпов ислама, не нести веру ислама другим, отказывать в милостыне нуждающимся, даровать Становление неверующему, обращать в рабство, нарушать клятву, убивать. Не питайтесь от неверного. Предпочтительно питаться от животных. Не даруйте Становление неверующему, а верующему - лишь с его согласия. Узы крови - это рабство: налагать их дозволено только на неверных, и если те явят истинное благочестие перед Богом, их можно освободить. Во всём следуйте Богу, и Зверь внутри будет изгнан. Последователи этого Пути не одобряют магию крови, а Серпентис, Демонион и Преображение запрещены полностью."
	alignment = MORALITY_HUMANITY
	bearing = BEARING_FAITH

/datum/morality/paradox
	name = "Path of Paradox"
	ru_name = "Путь Парадокса"
	desc = "Путь Парадокса строится вокруг кармического долга Сородичей. По убеждению его последователей, Сородичи ускользнули из сансары и должны исполнить свою свадхарму: двигать вперёд круговорот вселенной. На деле это означает либо помочь другим Сородичам найти своё место в этом круговороте, либо уничтожить их и тем вернуть в сансару."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_CONFIDENCE

/datum/morality/self_focus
	name = "Path of Self-Focus"
	ru_name = "Путь Внутреннего Фокуса"
	desc = "Интерналисты Пути Внутреннего Фокуса избрали своим кодексом недеяние и принятие: их не заботит ни то, что есть, ни то, что будет, только то, что сейчас. Они питаются и убивают, когда в том есть нужда, но большинству кажутся медлительными и безучастными. Благожелательный наблюдатель назвал бы их проницательными и склонными к самосозерцанию."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_BALANCE

/datum/morality/asakku
	name = "Path of Asakku"
	ru_name = "Путь Асакку"
	desc = "Последователи Асакку, которых часто называют Порчеными, - не столько идеология, сколько состояние, к которому приводит одержимое изучение Преображения и общение с тёмными разумами, что стоят за ним. Путь этот интуитивен, поэтому общим языком Порченые обзаводятся, лишь проработав вместе какое-то время, хотя те, кто зашёл далеко, порой проявляют странную согласованность. Сущность, которую они вызывают, они могут звать \"тенью внутри\" или \"Наблюдателем\" либо отождествлять с одним из клипотических демонов, связанных с Преображением. Преображение - средоточие одержимости Порченых. Они стремятся распространить эту силу как можно шире, через кровь и наставничество. Их возмущают нетронутые порчей Сородичи, получившие Преображение по праву клана или линии крови, и таких они с особым усердием обращают или уничтожают."
	alignment = MORALITY_ENLIGHTENMENT
	bearing = BEARING_OTHERWORLDLY
