// V20 Lore of the Clans - pages 238-239
/datum/quirk/darkpack/promethean_clay
	name = "Promethean Clay"
	ru_name = "Прометеева глина"
	desc = "(Примечание: пока это чисто ролевое достоинство, механика ещё в разработке.) Ваша плоть идёт рябью и меняется по вашей нечеловеческой воле едва ли не раньше, чем вы осознанно пожелаете перемены. Сложность применения любой способности Преображения на себе снижается на два, и вы можете активировать способности Преображения рефлекторно, с полным пулом проверки, совершая при этом другие действия. Способности, на активацию которых нужно несколько ходов, по-прежнему требуют обычного времени. Изменение просто происходит само, без сознательного усилия. Наконец, чтобы применить на себе первые три уровня Преображения, вам не нужно лепить плоть руками: она сама течёт и вытягивается, принимая нужную форму. Это достоинство могут взять только персонажи хотя бы с одной точкой Преображения."
	ttrpg_sources = list(/datum/source_book/vtm20/lotc = 238)
	value = 5
	mob_trait = TRAIT_PROMETHEAN_CLAY
	gain_text = span_notice("Вы ощущаете глубокое единство со своей немёртвой плотью. Вы извиваетесь под собственной кожей, и она отзывается дрожью, готовая подчиниться вашей воле и принять любую форму, словно глина.")
	lose_text = span_notice("Что-то... не так. Вы больше не чувствуете связи со своей плотью. Нерушимое единство воли и немёртвого тела слабеет, и плоть уже не откликается с прежней нечеловеческой послушностью.")
	allowed_splats = list(SPLAT_KINDRED)
	included_clans = list(VAMPIRE_CLAN_TZIMISCE)
	icon = FA_ICON_PERSON_BURST
	failure_message = "Что-то не так. Ваша плоть больше не откликается с нечеловеческой послушностью."
	roleplay_only = TRUE // REMOVE THIS WHEN PROMETHEAN CLAY MERIT IS IMPLEMENTED IN FULL

// hey, have you removed roleplay only after fully developing this merit? remove this too. did you remove it yet?
